espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_bufc.h
/* Bit fields for BUFC SFMIF */
#define _BUFC_SFMIF_RESETVALUE                               0x00000000UL                              /**< Default value for BUFC_SFMIF                */
#define _BUFC_SFMIF_MASK                                     0x9F1F1F1FUL                              /**< Mask for BUFC_SFMIF                         */
#define BUFC_SFMIF_BUF0OFSFMIF                               (0x1UL << 0)                              /**< Buffer 0 Overflow                           */
#define _BUFC_SFMIF_BUF0OFSFMIF_SHIFT                        0                                         /**< Shift value for BUFC_BUF0OFSFMIF            */
#define _BUFC_SFMIF_BUF0OFSFMIF_MASK                         0x1UL                                     /**< Bit mask for BUFC_BUF0OFSFMIF               */
#define _BUFC_SFMIF_BUF0OFSFMIF_DEFAULT                      0x00000000UL                              /**< Mode DEFAULT for BUFC_SFMIF                 */
#define BUFC_SFMIF_BUF0OFSFMIF_DEFAULT                       (_BUFC_SFMIF_BUF0OFSFMIF_DEFAULT << 0)    /**< Shifted mode DEFAULT for BUFC_SFMIF         */
#define BUFC_SFMIF_BUF0UFSFMIF                               (0x1UL << 1)                              /**< Buffer 0 Underflow                          */
#define _BUFC_SFMIF_BUF0UFSFMIF_SHIFT                        1                                         /**< Shift value for BUFC_BUF0UFSFMIF            */
#define _BUFC_SFMIF_BUF0UFSFMIF_MASK                         0x2UL                                     /**< Bit mask for BUFC_BUF0UFSFMIF               */
#define _BUFC_SFMIF_BUF0UFSFMIF_DEFAULT                      0x00000000UL                              /**< Mode DEFAULT for BUFC_SFMIF                 */
#define BUFC_SFMIF_BUF0UFSFMIF_DEFAULT                       (_BUFC_SFMIF_BUF0UFSFMIF_DEFAULT << 1)    /**< Shifted mode DEFAULT for BUFC_SFMIF         */
#define BUFC_SFMIF_BUF0THRSFMIF                              (0x1UL << 2)                              /**< Buffer 0 Threshold Event                    */
#define _BUFC_SFMIF_BUF0THRSFMIF_SHIFT                       2                                         /**< Shift value for BUFC_BUF0THRSFMIF           */
#define _BUFC_SFMIF_BUF0THRSFMIF_MASK                        0x4UL                                     /**< Bit mask for BUFC_BUF0THRSFMIF              */
#define _BUFC_SFMIF_BUF0THRSFMIF_DEFAULT                     0x00000000UL                              /**< Mode DEFAULT for BUFC_SFMIF                 */
#define BUFC_SFMIF_BUF0THRSFMIF_DEFAULT                      (_BUFC_SFMIF_BUF0THRSFMIF_DEFAULT << 2)   /**< Shifted mode DEFAULT for BUFC_SFMIF         */
#define BUFC_SFMIF_BUF0CORRSFMIF                             (0x1UL << 3)                              /**< Buffer 0 Corrupt                            */
#define _BUFC_SFMIF_BUF0CORRSFMIF_SHIFT                      3                                         /**< Shift value for BUFC_BUF0CORRSFMIF          */
#define _BUFC_SFMIF_BUF0CORRSFMIF_MASK                       0x8UL                                     /**< Bit mask for BUFC_BUF0CORRSFMIF             */
#define _BUFC_SFMIF_BUF0CORRSFMIF_DEFAULT                    0x00000000UL                              /**< Mode DEFAULT for BUFC_SFMIF                 */
#define BUFC_SFMIF_BUF0CORRSFMIF_DEFAULT                     (_BUFC_SFMIF_BUF0CORRSFMIF_DEFAULT << 3)  /**< Shifted mode DEFAULT for BUFC_SFMIF         */
#define BUFC_SFMIF_BUF0NWASFMIF                              (0x1UL << 4)                              /**< Buffer 0 Not Word-Aligned                   */
#define _BUFC_SFMIF_BUF0NWASFMIF_SHIFT                       4                                         /**< Shift value for BUFC_BUF0NWASFMIF           */
#define _BUFC_SFMIF_BUF0NWASFMIF_MASK                        0x10UL                                    /**< Bit mask for BUFC_BUF0NWASFMIF              */
#define _BUFC_SFMIF_BUF0NWASFMIF_DEFAULT                     0x00000000UL                              /**< Mode DEFAULT for BUFC_SFMIF                 */
#define BUFC_SFMIF_BUF0NWASFMIF_DEFAULT                      (_BUFC_SFMIF_BUF0NWASFMIF_DEFAULT << 4)   /**< Shifted mode DEFAULT for BUFC_SFMIF         */
#define BUFC_SFMIF_BUF1OFSFMIF                               (0x1UL << 8)                              /**< Buffer 1 Overflow                           */
#define _BUFC_SFMIF_BUF1OFSFMIF_SHIFT                        8                                         /**< Shift value for BUFC_BUF1OFSFMIF            */
#define _BUFC_SFMIF_BUF1OFSFMIF_MASK                         0x100UL                                   /**< Bit mask for BUFC_BUF1OFSFMIF               */
#define _BUFC_SFMIF_BUF1OFSFMIF_DEFAULT                      0x00000000UL                              /**< Mode DEFAULT for BUFC_SFMIF                 */
#define BUFC_SFMIF_BUF1OFSFMIF_DEFAULT                       (_BUFC_SFMIF_BUF1OFSFMIF_DEFAULT << 8)    /**< Shifted mode DEFAULT for BUFC_SFMIF         */
#define BUFC_SFMIF_BUF1UFSFMIF                               (0x1UL << 9)                              /**< Buffer 1 Underflow                          */
#define _BUFC_SFMIF_BUF1UFSFMIF_SHIFT                        9                                         /**< Shift value for BUFC_BUF1UFSFMIF            */
#define _BUFC_SFMIF_BUF1UFSFMIF_MASK                         0x200UL                                   /**< Bit mask for BUFC_BUF1UFSFMIF               */
#define _BUFC_SFMIF_BUF1UFSFMIF_DEFAULT                      0x00000000UL                              /**< Mode DEFAULT for BUFC_SFMIF                 */
#define BUFC_SFMIF_BUF1UFSFMIF_DEFAULT                       (_BUFC_SFMIF_BUF1UFSFMIF_DEFAULT << 9)    /**< Shifted mode DEFAULT for BUFC_SFMIF         */
#define BUFC_SFMIF_BUF1THRSFMIF                              (0x1UL << 10)                             /**< Buffer 1 Threshold Event                    */
#define _BUFC_SFMIF_BUF1THRSFMIF_SHIFT                       10                                        /**< Shift value for BUFC_BUF1THRSFMIF           */
#define _BUFC_SFMIF_BUF1THRSFMIF_MASK                        0x400UL                                   /**< Bit mask for BUFC_BUF1THRSFMIF              */
#define _BUFC_SFMIF_BUF1THRSFMIF_DEFAULT                     0x00000000UL                              /**< Mode DEFAULT for BUFC_SFMIF                 */
#define BUFC_SFMIF_BUF1THRSFMIF_DEFAULT                      (_BUFC_SFMIF_BUF1THRSFMIF_DEFAULT << 10)  /**< Shifted mode DEFAULT for BUFC_SFMIF         */
#define BUFC_SFMIF_BUF1CORRSFMIF                             (0x1UL << 11)                             /**< Buffer 1 Corrupt                            */
#define _BUFC_SFMIF_BUF1CORRSFMIF_SHIFT                      11                                        /**< Shift value for BUFC_BUF1CORRSFMIF          */
#define _BUFC_SFMIF_BUF1CORRSFMIF_MASK                       0x800UL                                   /**< Bit mask for BUFC_BUF1CORRSFMIF             */
#define _BUFC_SFMIF_BUF1CORRSFMIF_DEFAULT                    0x00000000UL                              /**< Mode DEFAULT for BUFC_SFMIF                 */
#define BUFC_SFMIF_BUF1CORRSFMIF_DEFAULT                     (_BUFC_SFMIF_BUF1CORRSFMIF_DEFAULT << 11) /**< Shifted mode DEFAULT for BUFC_SFMIF         */
#define BUFC_SFMIF_BUF1NWASFMIF                              (0x1UL << 12)                             /**< Buffer 1 Not Word-Aligned                   */
#define _BUFC_SFMIF_BUF1NWASFMIF_SHIFT                       12                                        /**< Shift value for BUFC_BUF1NWASFMIF           */
#define _BUFC_SFMIF_BUF1NWASFMIF_MASK                        0x1000UL                                  /**< Bit mask for BUFC_BUF1NWASFMIF              */
#define _BUFC_SFMIF_BUF1NWASFMIF_DEFAULT                     0x00000000UL                              /**< Mode DEFAULT for BUFC_SFMIF                 */
#define BUFC_SFMIF_BUF1NWASFMIF_DEFAULT                      (_BUFC_SFMIF_BUF1NWASFMIF_DEFAULT << 12)  /**< Shifted mode DEFAULT for BUFC_SFMIF         */
#define BUFC_SFMIF_BUF2OFSFMIF                               (0x1UL << 16)                             /**< Buffer 2 Overflow                           */
#define _BUFC_SFMIF_BUF2OFSFMIF_SHIFT                        16                                        /**< Shift value for BUFC_BUF2OFSFMIF            */
#define _BUFC_SFMIF_BUF2OFSFMIF_MASK                         0x10000UL                                 /**< Bit mask for BUFC_BUF2OFSFMIF               */
#define _BUFC_SFMIF_BUF2OFSFMIF_DEFAULT                      0x00000000UL                              /**< Mode DEFAULT for BUFC_SFMIF                 */
#define BUFC_SFMIF_BUF2OFSFMIF_DEFAULT                       (_BUFC_SFMIF_BUF2OFSFMIF_DEFAULT << 16)   /**< Shifted mode DEFAULT for BUFC_SFMIF         */
#define BUFC_SFMIF_BUF2UFSFMIF                               (0x1UL << 17)                             /**< Buffer 2 Underflow                          */
#define _BUFC_SFMIF_BUF2UFSFMIF_SHIFT                        17                                        /**< Shift value for BUFC_BUF2UFSFMIF            */
#define _BUFC_SFMIF_BUF2UFSFMIF_MASK                         0x20000UL                                 /**< Bit mask for BUFC_BUF2UFSFMIF               */
#define _BUFC_SFMIF_BUF2UFSFMIF_DEFAULT                      0x00000000UL                              /**< Mode DEFAULT for BUFC_SFMIF                 */
#define BUFC_SFMIF_BUF2UFSFMIF_DEFAULT                       (_BUFC_SFMIF_BUF2UFSFMIF_DEFAULT << 17)   /**< Shifted mode DEFAULT for BUFC_SFMIF         */
#define BUFC_SFMIF_BUF2THRSFMIF                              (0x1UL << 18)                             /**< Buffer 2 Threshold Event                    */
#define _BUFC_SFMIF_BUF2THRSFMIF_SHIFT                       18                                        /**< Shift value for BUFC_BUF2THRSFMIF           */
#define _BUFC_SFMIF_BUF2THRSFMIF_MASK                        0x40000UL                                 /**< Bit mask for BUFC_BUF2THRSFMIF              */
#define _BUFC_SFMIF_BUF2THRSFMIF_DEFAULT                     0x00000000UL                              /**< Mode DEFAULT for BUFC_SFMIF                 */
#define BUFC_SFMIF_BUF2THRSFMIF_DEFAULT                      (_BUFC_SFMIF_BUF2THRSFMIF_DEFAULT << 18)  /**< Shifted mode DEFAULT for BUFC_SFMIF         */
#define BUFC_SFMIF_BUF2CORRSFMIF                             (0x1UL << 19)                             /**< Buffer 2 Corrupt                            */
#define _BUFC_SFMIF_BUF2CORRSFMIF_SHIFT                      19                                        /**< Shift value for BUFC_BUF2CORRSFMIF          */
#define _BUFC_SFMIF_BUF2CORRSFMIF_MASK                       0x80000UL                                 /**< Bit mask for BUFC_BUF2CORRSFMIF             */
#define _BUFC_SFMIF_BUF2CORRSFMIF_DEFAULT                    0x00000000UL                              /**< Mode DEFAULT for BUFC_SFMIF                 */
#define BUFC_SFMIF_BUF2CORRSFMIF_DEFAULT                     (_BUFC_SFMIF_BUF2CORRSFMIF_DEFAULT << 19) /**< Shifted mode DEFAULT for BUFC_SFMIF         */
#define BUFC_SFMIF_BUF2NWASFMIF                              (0x1UL << 20)                             /**< Buffer 2 Not Word-Aligned                   */
#define _BUFC_SFMIF_BUF2NWASFMIF_SHIFT                       20                                        /**< Shift value for BUFC_BUF2NWASFMIF           */
#define _BUFC_SFMIF_BUF2NWASFMIF_MASK                        0x100000UL                                /**< Bit mask for BUFC_BUF2NWASFMIF              */
#define _BUFC_SFMIF_BUF2NWASFMIF_DEFAULT                     0x00000000UL                              /**< Mode DEFAULT for BUFC_SFMIF                 */
#define BUFC_SFMIF_BUF2NWASFMIF_DEFAULT                      (_BUFC_SFMIF_BUF2NWASFMIF_DEFAULT << 20)  /**< Shifted mode DEFAULT for BUFC_SFMIF         */
#define BUFC_SFMIF_BUF3OFSFMIF                               (0x1UL << 24)                             /**< Buffer 3 Overflow                           */
#define _BUFC_SFMIF_BUF3OFSFMIF_SHIFT                        24                                        /**< Shift value for BUFC_BUF3OFSFMIF            */
#define _BUFC_SFMIF_BUF3OFSFMIF_MASK                         0x1000000UL                               /**< Bit mask for BUFC_BUF3OFSFMIF               */
#define _BUFC_SFMIF_BUF3OFSFMIF_DEFAULT                      0x00000000UL                              /**< Mode DEFAULT for BUFC_SFMIF                 */
#define BUFC_SFMIF_BUF3OFSFMIF_DEFAULT                       (_BUFC_SFMIF_BUF3OFSFMIF_DEFAULT << 24)   /**< Shifted mode DEFAULT for BUFC_SFMIF         */
#define BUFC_SFMIF_BUF3UFSFMIF                               (0x1UL << 25)                             /**< Buffer 3 Underflow                          */
#define _BUFC_SFMIF_BUF3UFSFMIF_SHIFT                        25                                        /**< Shift value for BUFC_BUF3UFSFMIF            */
#define _BUFC_SFMIF_BUF3UFSFMIF_MASK                         0x2000000UL                               /**< Bit mask for BUFC_BUF3UFSFMIF               */
#define _BUFC_SFMIF_BUF3UFSFMIF_DEFAULT                      0x00000000UL                              /**< Mode DEFAULT for BUFC_SFMIF                 */
#define BUFC_SFMIF_BUF3UFSFMIF_DEFAULT                       (_BUFC_SFMIF_BUF3UFSFMIF_DEFAULT << 25)   /**< Shifted mode DEFAULT for BUFC_SFMIF         */
#define BUFC_SFMIF_BUF3THRSFMIF                              (0x1UL << 26)                             /**< Buffer 3 Threshold Event                    */
#define _BUFC_SFMIF_BUF3THRSFMIF_SHIFT                       26                                        /**< Shift value for BUFC_BUF3THRSFMIF           */
#define _BUFC_SFMIF_BUF3THRSFMIF_MASK                        0x4000000UL                               /**< Bit mask for BUFC_BUF3THRSFMIF              */
#define _BUFC_SFMIF_BUF3THRSFMIF_DEFAULT                     0x00000000UL                              /**< Mode DEFAULT for BUFC_SFMIF                 */
#define BUFC_SFMIF_BUF3THRSFMIF_DEFAULT                      (_BUFC_SFMIF_BUF3THRSFMIF_DEFAULT << 26)  /**< Shifted mode DEFAULT for BUFC_SFMIF         */
#define BUFC_SFMIF_BUF3CORRSFMIF                             (0x1UL << 27)                             /**< Buffer 3 Corrupt                            */
#define _BUFC_SFMIF_BUF3CORRSFMIF_SHIFT                      27                                        /**< Shift value for BUFC_BUF3CORRSFMIF          */
#define _BUFC_SFMIF_BUF3CORRSFMIF_MASK                       0x8000000UL                               /**< Bit mask for BUFC_BUF3CORRSFMIF             */
#define _BUFC_SFMIF_BUF3CORRSFMIF_DEFAULT                    0x00000000UL                              /**< Mode DEFAULT for BUFC_SFMIF                 */
#define BUFC_SFMIF_BUF3CORRSFMIF_DEFAULT                     (_BUFC_SFMIF_BUF3CORRSFMIF_DEFAULT << 27) /**< Shifted mode DEFAULT for BUFC_SFMIF         */
#define BUFC_SFMIF_BUF3NWASFMIF                              (0x1UL << 28)                             /**< Buffer 3 Not Word-Aligned                   */
#define _BUFC_SFMIF_BUF3NWASFMIF_SHIFT                       28                                        /**< Shift value for BUFC_BUF3NWASFMIF           */
#define _BUFC_SFMIF_BUF3NWASFMIF_MASK                        0x10000000UL                              /**< Bit mask for BUFC_BUF3NWASFMIF              */
#define _BUFC_SFMIF_BUF3NWASFMIF_DEFAULT                     0x00000000UL                              /**< Mode DEFAULT for BUFC_SFMIF                 */
#define BUFC_SFMIF_BUF3NWASFMIF_DEFAULT                      (_BUFC_SFMIF_BUF3NWASFMIF_DEFAULT << 28)  /**< Shifted mode DEFAULT for BUFC_SFMIF         */
#define BUFC_SFMIF_BUSERRORSFMIF                             (0x1UL << 31)                             /**< Bus Error                                   */
#define _BUFC_SFMIF_BUSERRORSFMIF_SHIFT                      31                                        /**< Shift value for BUFC_BUSERRORSFMIF          */
#define _BUFC_SFMIF_BUSERRORSFMIF_MASK                       0x80000000UL                              /**< Bit mask for BUFC_BUSERRORSFMIF             */
#define _BUFC_SFMIF_BUSERRORSFMIF_DEFAULT                    0x00000000UL                              /**< Mode DEFAULT for BUFC_SFMIF                 */
#define BUFC_SFMIF_BUSERRORSFMIF_DEFAULT                     (_BUFC_SFMIF_BUSERRORSFMIF_DEFAULT << 31) /**< Shifted mode DEFAULT for BUFC_SFMIF         */

