espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_bufc.h
/* Bit fields for BUFC SFMIEN */
#define _BUFC_SFMIEN_RESETVALUE                              0x00000000UL                                /**< Default value for BUFC_SFMIEN               */
#define _BUFC_SFMIEN_MASK                                    0x9F1F1F1FUL                                /**< Mask for BUFC_SFMIEN                        */
#define BUFC_SFMIEN_BUF0OFSFMIEN                             (0x1UL << 0)                                /**< BUF0OF Interrupt Enable                     */
#define _BUFC_SFMIEN_BUF0OFSFMIEN_SHIFT                      0                                           /**< Shift value for BUFC_BUF0OFSFMIEN           */
#define _BUFC_SFMIEN_BUF0OFSFMIEN_MASK                       0x1UL                                       /**< Bit mask for BUFC_BUF0OFSFMIEN              */
#define _BUFC_SFMIEN_BUF0OFSFMIEN_DEFAULT                    0x00000000UL                                /**< Mode DEFAULT for BUFC_SFMIEN                */
#define BUFC_SFMIEN_BUF0OFSFMIEN_DEFAULT                     (_BUFC_SFMIEN_BUF0OFSFMIEN_DEFAULT << 0)    /**< Shifted mode DEFAULT for BUFC_SFMIEN        */
#define BUFC_SFMIEN_BUF0UFSFMIEN                             (0x1UL << 1)                                /**< BUF0UF Interrupt Enable                     */
#define _BUFC_SFMIEN_BUF0UFSFMIEN_SHIFT                      1                                           /**< Shift value for BUFC_BUF0UFSFMIEN           */
#define _BUFC_SFMIEN_BUF0UFSFMIEN_MASK                       0x2UL                                       /**< Bit mask for BUFC_BUF0UFSFMIEN              */
#define _BUFC_SFMIEN_BUF0UFSFMIEN_DEFAULT                    0x00000000UL                                /**< Mode DEFAULT for BUFC_SFMIEN                */
#define BUFC_SFMIEN_BUF0UFSFMIEN_DEFAULT                     (_BUFC_SFMIEN_BUF0UFSFMIEN_DEFAULT << 1)    /**< Shifted mode DEFAULT for BUFC_SFMIEN        */
#define BUFC_SFMIEN_BUF0THRSFMIEN                            (0x1UL << 2)                                /**< BUF0THR Interrupt Enable                    */
#define _BUFC_SFMIEN_BUF0THRSFMIEN_SHIFT                     2                                           /**< Shift value for BUFC_BUF0THRSFMIEN          */
#define _BUFC_SFMIEN_BUF0THRSFMIEN_MASK                      0x4UL                                       /**< Bit mask for BUFC_BUF0THRSFMIEN             */
#define _BUFC_SFMIEN_BUF0THRSFMIEN_DEFAULT                   0x00000000UL                                /**< Mode DEFAULT for BUFC_SFMIEN                */
#define BUFC_SFMIEN_BUF0THRSFMIEN_DEFAULT                    (_BUFC_SFMIEN_BUF0THRSFMIEN_DEFAULT << 2)   /**< Shifted mode DEFAULT for BUFC_SFMIEN        */
#define BUFC_SFMIEN_BUF0CORRSFMIEN                           (0x1UL << 3)                                /**< BUF0CORR Interrupt Enable                   */
#define _BUFC_SFMIEN_BUF0CORRSFMIEN_SHIFT                    3                                           /**< Shift value for BUFC_BUF0CORRSFMIEN         */
#define _BUFC_SFMIEN_BUF0CORRSFMIEN_MASK                     0x8UL                                       /**< Bit mask for BUFC_BUF0CORRSFMIEN            */
#define _BUFC_SFMIEN_BUF0CORRSFMIEN_DEFAULT                  0x00000000UL                                /**< Mode DEFAULT for BUFC_SFMIEN                */
#define BUFC_SFMIEN_BUF0CORRSFMIEN_DEFAULT                   (_BUFC_SFMIEN_BUF0CORRSFMIEN_DEFAULT << 3)  /**< Shifted mode DEFAULT for BUFC_SFMIEN        */
#define BUFC_SFMIEN_BUF0NWASFMIEN                            (0x1UL << 4)                                /**< BUF0NWA Interrupt Enable                    */
#define _BUFC_SFMIEN_BUF0NWASFMIEN_SHIFT                     4                                           /**< Shift value for BUFC_BUF0NWASFMIEN          */
#define _BUFC_SFMIEN_BUF0NWASFMIEN_MASK                      0x10UL                                      /**< Bit mask for BUFC_BUF0NWASFMIEN             */
#define _BUFC_SFMIEN_BUF0NWASFMIEN_DEFAULT                   0x00000000UL                                /**< Mode DEFAULT for BUFC_SFMIEN                */
#define BUFC_SFMIEN_BUF0NWASFMIEN_DEFAULT                    (_BUFC_SFMIEN_BUF0NWASFMIEN_DEFAULT << 4)   /**< Shifted mode DEFAULT for BUFC_SFMIEN        */
#define BUFC_SFMIEN_BUF1OFSFMIEN                             (0x1UL << 8)                                /**< BUF1OF Interrupt Enable                     */
#define _BUFC_SFMIEN_BUF1OFSFMIEN_SHIFT                      8                                           /**< Shift value for BUFC_BUF1OFSFMIEN           */
#define _BUFC_SFMIEN_BUF1OFSFMIEN_MASK                       0x100UL                                     /**< Bit mask for BUFC_BUF1OFSFMIEN              */
#define _BUFC_SFMIEN_BUF1OFSFMIEN_DEFAULT                    0x00000000UL                                /**< Mode DEFAULT for BUFC_SFMIEN                */
#define BUFC_SFMIEN_BUF1OFSFMIEN_DEFAULT                     (_BUFC_SFMIEN_BUF1OFSFMIEN_DEFAULT << 8)    /**< Shifted mode DEFAULT for BUFC_SFMIEN        */
#define BUFC_SFMIEN_BUF1UFSFMIEN                             (0x1UL << 9)                                /**< BUF1UF Interrupt Enable                     */
#define _BUFC_SFMIEN_BUF1UFSFMIEN_SHIFT                      9                                           /**< Shift value for BUFC_BUF1UFSFMIEN           */
#define _BUFC_SFMIEN_BUF1UFSFMIEN_MASK                       0x200UL                                     /**< Bit mask for BUFC_BUF1UFSFMIEN              */
#define _BUFC_SFMIEN_BUF1UFSFMIEN_DEFAULT                    0x00000000UL                                /**< Mode DEFAULT for BUFC_SFMIEN                */
#define BUFC_SFMIEN_BUF1UFSFMIEN_DEFAULT                     (_BUFC_SFMIEN_BUF1UFSFMIEN_DEFAULT << 9)    /**< Shifted mode DEFAULT for BUFC_SFMIEN        */
#define BUFC_SFMIEN_BUF1THRSFMIEN                            (0x1UL << 10)                               /**< BUF1THR Interrupt Enable                    */
#define _BUFC_SFMIEN_BUF1THRSFMIEN_SHIFT                     10                                          /**< Shift value for BUFC_BUF1THRSFMIEN          */
#define _BUFC_SFMIEN_BUF1THRSFMIEN_MASK                      0x400UL                                     /**< Bit mask for BUFC_BUF1THRSFMIEN             */
#define _BUFC_SFMIEN_BUF1THRSFMIEN_DEFAULT                   0x00000000UL                                /**< Mode DEFAULT for BUFC_SFMIEN                */
#define BUFC_SFMIEN_BUF1THRSFMIEN_DEFAULT                    (_BUFC_SFMIEN_BUF1THRSFMIEN_DEFAULT << 10)  /**< Shifted mode DEFAULT for BUFC_SFMIEN        */
#define BUFC_SFMIEN_BUF1CORRSFMIEN                           (0x1UL << 11)                               /**< BUF1CORR Interrupt Enable                   */
#define _BUFC_SFMIEN_BUF1CORRSFMIEN_SHIFT                    11                                          /**< Shift value for BUFC_BUF1CORRSFMIEN         */
#define _BUFC_SFMIEN_BUF1CORRSFMIEN_MASK                     0x800UL                                     /**< Bit mask for BUFC_BUF1CORRSFMIEN            */
#define _BUFC_SFMIEN_BUF1CORRSFMIEN_DEFAULT                  0x00000000UL                                /**< Mode DEFAULT for BUFC_SFMIEN                */
#define BUFC_SFMIEN_BUF1CORRSFMIEN_DEFAULT                   (_BUFC_SFMIEN_BUF1CORRSFMIEN_DEFAULT << 11) /**< Shifted mode DEFAULT for BUFC_SFMIEN        */
#define BUFC_SFMIEN_BUF1NWASFMIEN                            (0x1UL << 12)                               /**< BUF1NWA Interrupt Enable                    */
#define _BUFC_SFMIEN_BUF1NWASFMIEN_SHIFT                     12                                          /**< Shift value for BUFC_BUF1NWASFMIEN          */
#define _BUFC_SFMIEN_BUF1NWASFMIEN_MASK                      0x1000UL                                    /**< Bit mask for BUFC_BUF1NWASFMIEN             */
#define _BUFC_SFMIEN_BUF1NWASFMIEN_DEFAULT                   0x00000000UL                                /**< Mode DEFAULT for BUFC_SFMIEN                */
#define BUFC_SFMIEN_BUF1NWASFMIEN_DEFAULT                    (_BUFC_SFMIEN_BUF1NWASFMIEN_DEFAULT << 12)  /**< Shifted mode DEFAULT for BUFC_SFMIEN        */
#define BUFC_SFMIEN_BUF2OFSFMIEN                             (0x1UL << 16)                               /**< BUF2OF Interrupt Enable                     */
#define _BUFC_SFMIEN_BUF2OFSFMIEN_SHIFT                      16                                          /**< Shift value for BUFC_BUF2OFSFMIEN           */
#define _BUFC_SFMIEN_BUF2OFSFMIEN_MASK                       0x10000UL                                   /**< Bit mask for BUFC_BUF2OFSFMIEN              */
#define _BUFC_SFMIEN_BUF2OFSFMIEN_DEFAULT                    0x00000000UL                                /**< Mode DEFAULT for BUFC_SFMIEN                */
#define BUFC_SFMIEN_BUF2OFSFMIEN_DEFAULT                     (_BUFC_SFMIEN_BUF2OFSFMIEN_DEFAULT << 16)   /**< Shifted mode DEFAULT for BUFC_SFMIEN        */
#define BUFC_SFMIEN_BUF2UFSFMIEN                             (0x1UL << 17)                               /**< BUF2UF Interrupt Enable                     */
#define _BUFC_SFMIEN_BUF2UFSFMIEN_SHIFT                      17                                          /**< Shift value for BUFC_BUF2UFSFMIEN           */
#define _BUFC_SFMIEN_BUF2UFSFMIEN_MASK                       0x20000UL                                   /**< Bit mask for BUFC_BUF2UFSFMIEN              */
#define _BUFC_SFMIEN_BUF2UFSFMIEN_DEFAULT                    0x00000000UL                                /**< Mode DEFAULT for BUFC_SFMIEN                */
#define BUFC_SFMIEN_BUF2UFSFMIEN_DEFAULT                     (_BUFC_SFMIEN_BUF2UFSFMIEN_DEFAULT << 17)   /**< Shifted mode DEFAULT for BUFC_SFMIEN        */
#define BUFC_SFMIEN_BUF2THRSFMIEN                            (0x1UL << 18)                               /**< BUF2THR Interrupt Enable                    */
#define _BUFC_SFMIEN_BUF2THRSFMIEN_SHIFT                     18                                          /**< Shift value for BUFC_BUF2THRSFMIEN          */
#define _BUFC_SFMIEN_BUF2THRSFMIEN_MASK                      0x40000UL                                   /**< Bit mask for BUFC_BUF2THRSFMIEN             */
#define _BUFC_SFMIEN_BUF2THRSFMIEN_DEFAULT                   0x00000000UL                                /**< Mode DEFAULT for BUFC_SFMIEN                */
#define BUFC_SFMIEN_BUF2THRSFMIEN_DEFAULT                    (_BUFC_SFMIEN_BUF2THRSFMIEN_DEFAULT << 18)  /**< Shifted mode DEFAULT for BUFC_SFMIEN        */
#define BUFC_SFMIEN_BUF2CORRSFMIEN                           (0x1UL << 19)                               /**< BUF2CORR Interrupt Enable                   */
#define _BUFC_SFMIEN_BUF2CORRSFMIEN_SHIFT                    19                                          /**< Shift value for BUFC_BUF2CORRSFMIEN         */
#define _BUFC_SFMIEN_BUF2CORRSFMIEN_MASK                     0x80000UL                                   /**< Bit mask for BUFC_BUF2CORRSFMIEN            */
#define _BUFC_SFMIEN_BUF2CORRSFMIEN_DEFAULT                  0x00000000UL                                /**< Mode DEFAULT for BUFC_SFMIEN                */
#define BUFC_SFMIEN_BUF2CORRSFMIEN_DEFAULT                   (_BUFC_SFMIEN_BUF2CORRSFMIEN_DEFAULT << 19) /**< Shifted mode DEFAULT for BUFC_SFMIEN        */
#define BUFC_SFMIEN_BUF2NWASFMIEN                            (0x1UL << 20)                               /**< BUF2NWA Interrupt Enable                    */
#define _BUFC_SFMIEN_BUF2NWASFMIEN_SHIFT                     20                                          /**< Shift value for BUFC_BUF2NWASFMIEN          */
#define _BUFC_SFMIEN_BUF2NWASFMIEN_MASK                      0x100000UL                                  /**< Bit mask for BUFC_BUF2NWASFMIEN             */
#define _BUFC_SFMIEN_BUF2NWASFMIEN_DEFAULT                   0x00000000UL                                /**< Mode DEFAULT for BUFC_SFMIEN                */
#define BUFC_SFMIEN_BUF2NWASFMIEN_DEFAULT                    (_BUFC_SFMIEN_BUF2NWASFMIEN_DEFAULT << 20)  /**< Shifted mode DEFAULT for BUFC_SFMIEN        */
#define BUFC_SFMIEN_BUF3OFSFMIEN                             (0x1UL << 24)                               /**< BUF3OF Interrupt Enable                     */
#define _BUFC_SFMIEN_BUF3OFSFMIEN_SHIFT                      24                                          /**< Shift value for BUFC_BUF3OFSFMIEN           */
#define _BUFC_SFMIEN_BUF3OFSFMIEN_MASK                       0x1000000UL                                 /**< Bit mask for BUFC_BUF3OFSFMIEN              */
#define _BUFC_SFMIEN_BUF3OFSFMIEN_DEFAULT                    0x00000000UL                                /**< Mode DEFAULT for BUFC_SFMIEN                */
#define BUFC_SFMIEN_BUF3OFSFMIEN_DEFAULT                     (_BUFC_SFMIEN_BUF3OFSFMIEN_DEFAULT << 24)   /**< Shifted mode DEFAULT for BUFC_SFMIEN        */
#define BUFC_SFMIEN_BUF3UFSFMIEN                             (0x1UL << 25)                               /**< BUF3UF Interrupt Enable                     */
#define _BUFC_SFMIEN_BUF3UFSFMIEN_SHIFT                      25                                          /**< Shift value for BUFC_BUF3UFSFMIEN           */
#define _BUFC_SFMIEN_BUF3UFSFMIEN_MASK                       0x2000000UL                                 /**< Bit mask for BUFC_BUF3UFSFMIEN              */
#define _BUFC_SFMIEN_BUF3UFSFMIEN_DEFAULT                    0x00000000UL                                /**< Mode DEFAULT for BUFC_SFMIEN                */
#define BUFC_SFMIEN_BUF3UFSFMIEN_DEFAULT                     (_BUFC_SFMIEN_BUF3UFSFMIEN_DEFAULT << 25)   /**< Shifted mode DEFAULT for BUFC_SFMIEN        */
#define BUFC_SFMIEN_BUF3THRSFMIEN                            (0x1UL << 26)                               /**< BUF3THR Interrupt Enable                    */
#define _BUFC_SFMIEN_BUF3THRSFMIEN_SHIFT                     26                                          /**< Shift value for BUFC_BUF3THRSFMIEN          */
#define _BUFC_SFMIEN_BUF3THRSFMIEN_MASK                      0x4000000UL                                 /**< Bit mask for BUFC_BUF3THRSFMIEN             */
#define _BUFC_SFMIEN_BUF3THRSFMIEN_DEFAULT                   0x00000000UL                                /**< Mode DEFAULT for BUFC_SFMIEN                */
#define BUFC_SFMIEN_BUF3THRSFMIEN_DEFAULT                    (_BUFC_SFMIEN_BUF3THRSFMIEN_DEFAULT << 26)  /**< Shifted mode DEFAULT for BUFC_SFMIEN        */
#define BUFC_SFMIEN_BUF3CORRSFMIEN                           (0x1UL << 27)                               /**< BUF3CORR Interrupt Enable                   */
#define _BUFC_SFMIEN_BUF3CORRSFMIEN_SHIFT                    27                                          /**< Shift value for BUFC_BUF3CORRSFMIEN         */
#define _BUFC_SFMIEN_BUF3CORRSFMIEN_MASK                     0x8000000UL                                 /**< Bit mask for BUFC_BUF3CORRSFMIEN            */
#define _BUFC_SFMIEN_BUF3CORRSFMIEN_DEFAULT                  0x00000000UL                                /**< Mode DEFAULT for BUFC_SFMIEN                */
#define BUFC_SFMIEN_BUF3CORRSFMIEN_DEFAULT                   (_BUFC_SFMIEN_BUF3CORRSFMIEN_DEFAULT << 27) /**< Shifted mode DEFAULT for BUFC_SFMIEN        */
#define BUFC_SFMIEN_BUF3NWASFMIEN                            (0x1UL << 28)                               /**< BUF3NWA Interrupt Enable                    */
#define _BUFC_SFMIEN_BUF3NWASFMIEN_SHIFT                     28                                          /**< Shift value for BUFC_BUF3NWASFMIEN          */
#define _BUFC_SFMIEN_BUF3NWASFMIEN_MASK                      0x10000000UL                                /**< Bit mask for BUFC_BUF3NWASFMIEN             */
#define _BUFC_SFMIEN_BUF3NWASFMIEN_DEFAULT                   0x00000000UL                                /**< Mode DEFAULT for BUFC_SFMIEN                */
#define BUFC_SFMIEN_BUF3NWASFMIEN_DEFAULT                    (_BUFC_SFMIEN_BUF3NWASFMIEN_DEFAULT << 28)  /**< Shifted mode DEFAULT for BUFC_SFMIEN        */
#define BUFC_SFMIEN_BUSERRORSFMIEN                           (0x1UL << 31)                               /**< BUSERROR Interrupt Enable                   */
#define _BUFC_SFMIEN_BUSERRORSFMIEN_SHIFT                    31                                          /**< Shift value for BUFC_BUSERRORSFMIEN         */
#define _BUFC_SFMIEN_BUSERRORSFMIEN_MASK                     0x80000000UL                                /**< Bit mask for BUFC_BUSERRORSFMIEN            */
#define _BUFC_SFMIEN_BUSERRORSFMIEN_DEFAULT                  0x00000000UL                                /**< Mode DEFAULT for BUFC_SFMIEN                */
#define BUFC_SFMIEN_BUSERRORSFMIEN_DEFAULT                   (_BUFC_SFMIEN_BUSERRORSFMIEN_DEFAULT << 31) /**< Shifted mode DEFAULT for BUFC_SFMIEN        */

/** @} End of group EFR32FG25_BUFC_BitFields */
/** @} End of group EFR32FG25_BUFC */
/** @} End of group Parts */

#endif /* EFR32FG25_BUFC_H */
